console.log('Scrip connected!');

const arrayOfLoveWishes = [
    'Кохайте один одного! Це найважливіше',
    'Будьте щасливі!',
    'Кохання це важливо!',
    'Нехай кохання зігріває твоє серце щомиті!',
    'Хай любов завжди буде твоєю силою і натхненням!',
    'Бажаю тобі романтики, ніжності та тепла!',
    'Нехай твоя любов буде такою ж красивою, як ти!',
    'Бажаю тобі справжнього, щирого та вірного кохання!',
    "Нехай твоя любов буде такою ж яскравою, як сонце в небі!",
  "Бажаю тобі безмежного щастя поруч із найдорожчою людиною!",
  "Нехай кожен день дарує тобі ніжність і тепло коханих обіймів!",
  "Хай серце завжди співає від радості та кохання!",
  "Бажаю, щоб твоя любов була вічною та щирою!",
  "Нехай твоє серце завжди знаходить відгук у серці коханої людини!",
  "Хай кожен момент, проведений разом, буде сповнений гармонії та радості!",
  "Бажаю, щоб твоє кохання долало всі перешкоди та труднощі!",
  "Нехай ніжність і турбота завжди будуть частиною твоїх стосунків!",
  "Хай ваше кохання буде таким же безмежним, як небо над нами!",
  "Бажаю, щоб ваша історія кохання була найкращою казкою у світі!",
  "Нехай у твоєму житті завжди буде хтось, хто даруватиме тобі усмішку і тепло!",
  "Бажаю, щоб кожен день приносив тобі нові приводи для радості та любові!"
]

//console.log(arrayOfVitamins)
const arrayOfVitamins = [
  {
     id:1,
     title:"Вітамін А",
     photo:"vitamin-a.png",
     description:"Вітамін А — група близьких за хімічною будовою речовин, яка включає ретиноїди: ретинол (вітамін A1, аксерофтол), дегідроретинол (вітамін А2), ретиналь (ретинен, альдегід вітаміну A1), ретиноєву кислоту і кілька провітамінів — каротиноїдів, серед яких найважливішим є β-каротин.",
     rating:4,
     type:"кристалічні"
  },
  {
     id:2,
     title:"Вітамін С",
     photo:"vitamin-c.png",
     description:"Аскорбíнова кислотá (лат. Ascorbic acid (BP, JP, USP)[1][2][3], лат. Acidum ascorbinicum (PhEur)[1], гамма-лактон 2,3-дегідро-L-гулонової кислоти, вітамін C) — відносно проста органічна кислота.",
     rating:3,
     type:"водорозчинні"
  },
  {
     id:3,
     title:"Вітамін D",
     photo:"",
     description:"",
     rating:5,
     type:""
  },
  {
     id:4,
     title:"Вітамін B3",
     photo:"",
     description:"",
     rating:5,
     type:""
  },
  {
     id:5,
     title:"Омега-3",
     photo:"",
     description:"",
     rating:3,
     type:""
  },
  {
     id:6,
     title:"Magnium-B6",
     photo:"",
     description:"",
     rating:3,
     type:""
  },
  
]

//console.log(arrayOfVitamins)


arrayOfVitamins.forEach((item,index) =>{
  //console.log("елемент №",index,item)

  let divVitamin = document.createElement('div')
  divVitamin.classList.add('vitamin')

  divVitamin.innerHTML = `
        <span>${item.id}</span>
        <h3>${item.title}</h3>
        <hr>
        <img src="img/vitamins/${item.photo}" alt="">
        <p>${item.description}</p>
        <span>${'💚'.repeat(item.rating)+'🤍'.repeat(5-item.rating)}</span>
        <p>${item.type}</p> 
     `
  document.getElementById("p-vitamins").appendChild(divVitamin)
}) 